-- 删除tb_brand表
drop table if exists tb_brand;
-- 创建tb_brand表
create table tb_brand
(
    -- id 主键
    id           int primary key auto_increment,
    -- 品牌名称
    brandName   varchar(20),
    -- 企业名称
    companyName varchar(20),
    -- 排序字段
    ordered      int,
    -- 描述信息
    description  varchar(100),
    -- 状态：0：禁用  1：启用
    status       int
);
-- 添加数据
insert into tb_brand (brandName, companyName, ordered, description, status)
values
       ('小米8', '小米科技有限公司', 600, '我们的目标是星辰大海', 0),
       ('华为Mate40', '华为技术有限公司', 1300, '麒麟绝唱', 1),
       ('华为Mate8', '华为技术有限公司',300, '执念是一种信念', 0),
       ('一加8T', 'OPPO广东移动通信有限公司', 750, '直屏标杆，王者归来', 0),
       ('小米9', '小米科技有限公司', 800, '战斗天使，好看又能打', 1),
       ('小米11', '小米科技有限公司',1000, '相信美好，轻装上阵', 0),
       ('iPhone 13 Pro', '苹果公司', 2000, '强得很', 1),
       ('IQOO 8', 'iQOO公司',850, '全感操纵一触即发', 0),
       ('iPhone XR', '苹果公司', 100, '哪一面都是亮点', 0),
       ('红米K40', '小米科技有限公司', 850, '无敌性价比', 1),
       ('iPhone 13 Pro', '苹果公司', 2000, '强得很', 0),
       ('iPhone XS', '苹果公司', 450, '大屏幕上见', 0),
       ('小米10Pro', '小米科技有限公司', 900, '观·越天下', 1),
       ('iPhone 12 Pro', '苹果公司', 1500, '一拍即合', 1),
       ('OPPO Reno7 Pro', 'OPPO广东移动通信有限公司', 750, '最强自拍旗舰，照亮你的美 ', 0),
       ('华为Mate30', '华为技术有限公司', 650, '重构想像', 1),
       ('华为Mate40', '华为技术有限公司', 1300, '麒麟绝唱', 0),
       ('小米8', '小米科技有限公司', 600, '我们的目标是星辰大海', 1),
       ('iPhone SE', '苹果公司', 550, '称心称手，超值入手', 1),
       ('华为Mate20', '华为技术有限公司',800 , '智慧新高度', 1),
       ('小米11', '小米科技有限公司',1000, '相信美好，轻装上阵', 1),
       ('iPhone 11 Pro', '苹果公司', 950, '如其名', 1),
       ('Samaung GALAXY S4', '三星集团', 200, '与你心意合一', 0),
       ('Samaung GALAXY S6', '三星集团', 400, '让未来，现在就来', 0),
       ('华为Mate10', '华为技术有限公司', 300, '预见未来', 1),
       ('华为Mate10', '华为技术有限公司', 300, '预见未来', 0),
       ('iPhone 11', '苹果公司', 650, '—切都刚刚好', 0),
       ('红米K30', '小米科技有限公司', 750, '5G先锋，全速热爱', 0),
       ('iPhone 11', '苹果公司', 800, '—切都刚刚好', 0),
       ('红米K30', '小米科技有限公司', 750, '5G先锋，全速热爱', 1),
       ('iPhone SE', '苹果公司', 550, '称心称手，超值入手', 0),
       ('iPhone 11', '苹果公司', 800, '—切都刚刚好', 1),
       ('华为Mate9', '华为技术有限公司', 350, '进一步，更进一部', 1),
       ('iPhone 12 Pro', '苹果公司', 1500, '一拍即合', 0),
       ('华为Mate30', '华为技术有限公司', 650, '重构想像', 0),
       ('一加8T', 'OPPO广东移动通信有限公司', 750, '直屏标杆，王者归来', 1),
       ('iPhone XR', '苹果公司', 400, '哪一面都是亮点', 1),
       ('小米9', '小米科技有限公司', 800, '战斗天使，好看又能打', 0),
       ('华为Mate8', '华为技术有限公司',300, '执念是一种信念', 1),
       ('iPhone SE', '苹果公司', 50, '称心称手，超值入手', 0),
       ('IQOO 8', 'iQOO公司',850, '全感操纵一触即发', 1),
       ('小米10Pro', '小米科技有限公司', 900, '观·越天下', 0),
       ('iPhone X', '苹果公司', 250, 'hello，未来', 1),
       ('一加9', 'OPPO广东移动通信有限公司', 1100, '不将就', 0),
       ('Samaung GALAXY S4', '三星集团', 200, '与你心意合一', 1),
       ('红米K40', '小米科技有限公司', 850, '无敌性价比',0),
       ('iPhone XS', '苹果公司', 450, '大屏幕上见', 1),
       ('华为Mate20', '华为技术有限公司',800 , '智慧新高度', 0),
       ('华为Mate7', '华为技术有限公司', 150, '爵士人生', 1),
       ('Samaung GALAXY S5', '三星集团', 350, '点亮你的生活', 1),
       ('iPhone SE', '苹果公司', 50, '称心称手，超值入手', 1),
       ('iPhone XR', '苹果公司', 400, '哪一面都是亮点', 0),
       ('iPhone X', '苹果公司', 250, 'hello，未来', 0),
       ('一加9', 'OPPO广东移动通信有限公司', 1100, '不将就', 1),
       ('iPhone 11 Pro', '苹果公司', 950, '如其名', 0),
       ('Samaung GALAXY S6', '三星集团', 400, '让未来，现在就来', 1),
       ('iPhone 11', '苹果公司', 650, '—切都刚刚好', 1),
       ('华为Mate7', '华为技术有限公司', 150, '爵士人生', 0),
       ('OPPO Reno7 Pro', 'OPPO广东移动通信有限公司', 750, '最强自拍旗舰，照亮你的美 ', 1),
       ('iPhone XR', '苹果公司', 100, '哪一面都是亮点', 1),
       ('Samaung GALAXY S5', '三星集团', 350, '点亮你的生活', 0),
       ('华为Mate9', '华为技术有限公司', 350, '进一步，更进一部', 0)
        ;

SELECT * FROM tb_brand;

-- 删除tb_user表
drop table if exists tb_user;
-- 创建用户表
CREATE TABLE tb_user(
	id int primary key auto_increment,
	username varchar(20) unique,
	password varchar(32)
);

-- 添加数据
INSERT INTO tb_user(username,password) values('zhangsan','123'),('xiaojin','234'),('xiaohan','345');

SELECT * FROM tb_user;